{
  "id": "1f57f10e-1dc5-47ea-852c-2e85b2503d79",
  "name": "Cisco Secure Firewall - Repeated Blocked Connections",
  "description": "The following analytic detects repeated blocked connection attempts from the same initiator to the same responder within a short time window. It leverages Cisco Secure Firewall Threat Defense logs and identifies connections where the action is set to Block, and the number of occurrences reaches or exceeds a threshold of ten within a one-minute span. This pattern may indicate a misconfigured application, unauthorized access attempts, or early stages of a brute-force or scanning operation. If confirmed malicious, this behavior may represent an attacker probing the network, attempting lateral movement, or testing firewall rules for weaknesses.\n",
  "source": {
    "type": "splunk",
    "id": "1f57f10e-1dc5-47ea-852c-2e85b2503d79",
    "url": "https://github.com/splunk/security_content/blob/develop/cisco_secure_firewall___repeated_blocked_connections.yml",
    "file_path": "tmp/repos/splunk/detections/network/cisco_secure_firewall___repeated_blocked_connections.yml"
  },
  "tags": [
    "analytic_story",
    "asset_type",
    "mitre_attack_id",
    "product",
    "security_domain"
  ],
  "author": "Nasreddine Bencherchali, Splunk",
  "references": [
    "https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf"
  ],
  "severity": "medium",
  "type": "splunk",
  "status": "production",
  "created": "2025-05-02",
  "modified": "2025-05-02",
  "mitre": {
    "tactics": [],
    "techniques": []
  },
  "detection": {
    "query": "`cisco_secure_firewall` EventType=ConnectionEvent action=Block \n| bin _time span=1m \n| stats count min(_time) as firstTime max(_time) as lastTime\n    Values(dest_port) as dest_port\n    Values(url) as url\n    by src_ip, dest, transport, rule, action\n| where count >= 10\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n| `cisco_secure_firewall___repeated_blocked_connections_filter`\n",
    "condition": "This search requires Cisco Secure Firewall Threat Defense Logs, which\nincludes the ConnectionEvent EventType. This search uses an input macro named `cisco_secure_firewall`.\nWe strongly recommend that you specify your environment-specific configurations\n(index, source, sourcetype, etc.) for Cisco Secure Firewall Threat Defense logs. Replace the macro definition\nwith configurations for your Splunk environment. The search also uses a post-filter\nmacro designed to filter out known false positives.\nThe logs are to be ingested using the Splunk Add-on for Cisco Security Cloud (https://splunkbase.splunk.com/app/7404).\nThe access policy must also enable logging.\n",
    "fields": []
  },
  "falsepositives": [
    "Misconfigured applications or automated scripts may generate repeated blocked traffic, particularly if attempting to reach decommissioned or restricted resources.\nVulnerability scanners or penetration testing tools running in authorized environments may trigger this alert.\nTuning may be required to exclude known internal tools or scanner IPs from detection.\n"
  ],
  "level": "medium",
  "rule_format": "standard",
  "platforms": [],
  "data_sources": []
}