{
  "id": "7b87c556-0ca4-47e0-b84c-6cd62a0a3e90",
  "name": "Linux Auditd Change File Owner To Root",
  "description": "The following analytic detects the use of the 'chown' command to change a file owner to 'root' on a Linux system. It leverages Linux Auditd telemetry, specifically monitoring command-line executions and process details. This activity is significant as it may indicate an attempt to escalate privileges by adversaries, malware, or red teamers. If confirmed malicious, this action could allow an attacker to gain root-level access, leading to full control over the compromised host and potential persistence within the environment.",
  "source": {
    "type": "splunk",
    "id": "7b87c556-0ca4-47e0-b84c-6cd62a0a3e90",
    "url": "https://github.com/splunk/security_content/blob/develop/linux_auditd_change_file_owner_to_root.yml",
    "file_path": "tmp/repos/splunk/detections/endpoint/linux_auditd_change_file_owner_to_root.yml"
  },
  "tags": [
    "analytic_story",
    "asset_type",
    "mitre_attack_id",
    "product",
    "security_domain"
  ],
  "author": "Teoderick Contreras, Splunk",
  "references": [
    "https://unix.stackexchange.com/questions/101073/how-to-change-permissions-from-root-user-to-all-users",
    "https://askubuntu.com/questions/617850/changing-from-user-to-superuser"
  ],
  "severity": "medium",
  "type": "splunk",
  "status": "production",
  "created": "2025-05-02",
  "modified": "2025-05-02",
  "mitre": {
    "tactics": [],
    "techniques": []
  },
  "detection": {
    "query": "`linux_auditd` proctitle = \"*chown *root*\" | rename host as dest | stats count min(_time) as firstTime max(_time) as lastTime by proctitle dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_auditd_change_file_owner_to_root_filter`",
    "condition": "To implement this detection, the process begins by ingesting auditd data, that consists of SYSCALL, TYPE, EXECVE and PROCTITLE events, which captures command-line executions and process details on Unix/Linux systems. These logs should be ingested and processed using Splunk Add-on for Unix and Linux (https://splunkbase.splunk.com/app/833), which is essential for correctly parsing and categorizing the data. The next step involves normalizing the field names  to match the field names set by the Splunk Common Information Model (CIM) to ensure consistency across different data sources and enhance the efficiency of data modeling. This approach enables effective monitoring and detection of linux endpoints where auditd is deployed",
    "fields": []
  },
  "falsepositives": [
    "Administrator or network operator can execute this command. Please update the filter macros to remove false positives."
  ],
  "level": "medium",
  "rule_format": "standard",
  "platforms": [],
  "data_sources": []
}