{
  "id": "8c15183e-2e70-4db4-86c3-88f8d9129b66",
  "name": "Cisco Secure Firewall - High EVE Threat Confidence",
  "description": "The following analytic detects connections with a high Encrypted Visibility Engine (EVE) threat confidence score, indicating potentially malicious behavior within encrypted traffic. It leverages Cisco Secure Firewall Threat Defense logs and evaluates the EVE_ThreatConfidencePct field, which reflects the system's confidence in classifying encrypted sessions as threats based on machine learning models and behavioral analysis. A score equal to or greater than 80 suggests the connection is highly likely to be associated with malware command and control (C2), remote access tools, or suspicious tunneling behavior. If confirmed malicious, this may indicate covert communication over TLS from compromised hosts.\n",
  "source": {
    "type": "splunk",
    "id": "8c15183e-2e70-4db4-86c3-88f8d9129b66",
    "url": "https://github.com/splunk/security_content/blob/develop/cisco_secure_firewall___high_eve_threat_confidence.yml",
    "file_path": "tmp/repos/splunk/detections/network/cisco_secure_firewall___high_eve_threat_confidence.yml"
  },
  "tags": [
    "analytic_story",
    "asset_type",
    "mitre_attack_id",
    "product",
    "security_domain"
  ],
  "author": "Nasreddine Bencherchali, Splunk",
  "references": [
    "https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf"
  ],
  "severity": "medium",
  "type": "splunk",
  "status": "production",
  "created": "2025-05-02",
  "modified": "2025-05-02",
  "mitre": {
    "tactics": [],
    "techniques": []
  },
  "detection": {
    "query": "`cisco_secure_firewall` EventType=ConnectionEvent EVE_ThreatConfidencePct >= 80\n| stats count min(_time) as firstTime max(_time) as lastTime\n    Values(rule) as rule\n    Values(url) as url\n    by EVE_Process, EVE_ThreatConfidencePct, src_ip, dest, dest_port, transport, action\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n| `cisco_secure_firewall___high_eve_threat_confidence_filter`\n",
    "condition": "This search requires Cisco Secure Firewall Threat Defense Logs, which\nincludes the ConnectionEvent EventType. This search uses an input macro named `cisco_secure_firewall`.\nWe strongly recommend that you specify your environment-specific configurations\n(index, source, sourcetype, etc.) for Cisco Secure Firewall Threat Defense logs. Replace the macro definition\nwith configurations for your Splunk environment. The search also uses a post-filter\nmacro designed to filter out known false positives.\nThe logs are to be ingested using the Splunk Add-on for Cisco Security Cloud (https://splunkbase.splunk.com/app/7404).\nThe access policy must also enable logging.\n",
    "fields": []
  },
  "falsepositives": [
    "Some benign applications may exhibit behaviors that resemble encrypted threat patterns, especially if they use uncommon encryption libraries or custom protocols.\nCustom-developed or internal tools may trigger high EVE confidence scores depending on how they encrypt data.\nIt is recommended to validate the associated process (`EVE_Process`) and destination context, and correlate with other logs (e.g., endpoint or threat intel) before taking response action.\n"
  ],
  "level": "medium",
  "rule_format": "standard",
  "platforms": [],
  "data_sources": []
}