{
  "id": "c43f7b49-2dab-4e76-892e-7f971c2f20f1",
  "name": "Cisco Secure Firewall - Blacklisted SSL Certificate Fingerprint",
  "description": "The following analytic detects the use of known suspicious SSL certificates in any observed event where the SSL_CertFingerprint field is present. It leverages Cisco Secure Firewall logs and compares the SSL certificate SHA1 fingerprint against a blacklist of certificates associated with malware distribution, command and control (C2) infrastructure, or phishing campaigns. This activity is significant as adversaries often reuse or self-sign certificates across malicious infrastructure, allowing defenders to track and detect encrypted sessions even when domains or IPs change. If confirmed malicious, this may indicate beaconing, malware download, or data exfiltration over TLS/SSL.\n",
  "source": {
    "type": "splunk",
    "id": "c43f7b49-2dab-4e76-892e-7f971c2f20f1",
    "url": "https://github.com/splunk/security_content/blob/develop/cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint.yml",
    "file_path": "tmp/repos/splunk/detections/network/cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint.yml"
  },
  "tags": [
    "analytic_story",
    "asset_type",
    "mitre_attack_id",
    "product",
    "security_domain"
  ],
  "author": "Nasreddine Bencherchali, Splunk",
  "references": [
    "https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf"
  ],
  "severity": "medium",
  "type": "splunk",
  "status": "production",
  "created": "2025-05-02",
  "modified": "2025-05-02",
  "mitre": {
    "tactics": [],
    "techniques": []
  },
  "detection": {
    "query": "`cisco_secure_firewall` EventType=* SSL_CertFingerprint=*\n| lookup sslbl_ssl_certificate_blacklist SHA1 as SSL_CertFingerprint OUTPUT Listingdate, Listingreason\n| where isnotnull(Listingreason)\n| stats min(_time) as firstTime max(_time) as lastTime\n        values(dest) as dest\n        values(dest_port) as dest_port\n        values(rule) as rule\n        values(url) as url\n        values(Listingreason) as Reasons\n        values(Listingdate) as \"SSL Cert Listing Dates\"\n        count by SSL_CertFingerprint src_ip transport action\n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n| `cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint_filter`\n",
    "condition": "This search requires Cisco Secure Firewall Threat Defense Logs, which\nincludes the ConnectionEvent EventType. This search uses an input macro named `cisco_secure_firewall`.\nWe strongly recommend that you specify your environment-specific configurations\n(index, source, sourcetype, etc.) for Cisco Secure Firewall Threat Defense logs. Replace the macro definition\nwith configurations for your Splunk environment. The search also uses a post-filter\nmacro designed to filter out known false positives.\nThe logs are to be ingested using the Splunk Add-on for Cisco Security Cloud (https://splunkbase.splunk.com/app/7404).\nThe access policy must also enable logging.\nThis search also make use of lookup based on https://sslbl.abuse.ch/blacklist/sslblacklist.csv. Make sure its available\n",
    "fields": []
  },
  "falsepositives": [
    "Certain SSL certificates may be flagged in threat intelligence feeds due to historical misuse, yet still be used by legitimate services, particularly in content delivery or shared hosting environments. Internal or self-signed certificates used in testing or development environments may inadvertently match known blacklisted fingerprints. It is recommended to validate the connection context (destination IP, domain, ClientApplication) and correlate with other indicators before taking action."
  ],
  "level": "medium",
  "rule_format": "standard",
  "platforms": [],
  "data_sources": []
}